# String operation
- pandas operation done by vectorization form. any operations done in series of data at once 
- to operte any string operation we can use .str accessor

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame(
  {  'name' : ['Ram sharma','Hari Mahato','Alex Pradhan','Bob Marley','Charlie Brown'],
    'email': ['ram@gmail.com','hari@gmail.com','alex@gmail.com','bob@gmail.com','charlie@gmail.com']
  })
df

            name              email
0     Ram sharma      ram@gmail.com
1    Hari Mahato     hari@gmail.com
2   Alex Pradhan     alex@gmail.com
3     Bob Marley      bob@gmail.com
4  Charlie Brown  charlie@gmail.com

In [5]:
# case conversion
df.name

0       Ram sharma
1      Hari Mahato
2     Alex Pradhan
3       Bob Marley
4    Charlie Brown
Name: name, dtype: object

# case conversion

In [6]:
df.name.str.lower()

0       ram sharma
1      hari mahato
2     alex pradhan
3       bob marley
4    charlie brown
Name: name, dtype: object

In [7]:
df.name.str.upper()

0       RAM SHARMA
1      HARI MAHATO
2     ALEX PRADHAN
3       BOB MARLEY
4    CHARLIE BROWN
Name: name, dtype: object

In [8]:
df.name.str.title()

0       Ram Sharma
1      Hari Mahato
2     Alex Pradhan
3       Bob Marley
4    Charlie Brown
Name: name, dtype: object

In [9]:
df.name.str.capitalize()

0       Ram sharma
1      Hari mahato
2     Alex pradhan
3       Bob marley
4    Charlie brown
Name: name, dtype: object

In [12]:
#length of string
df[df.name.str.len()==10]

         name          email
0  Ram sharma  ram@gmail.com
3  Bob Marley  bob@gmail.com

In [17]:
# repeatation of substring
df.name.str.count('a')

0    3
1    3
2    2
3    1
4    1
Name: name, dtype: int64

In [18]:
titanic=pd.read_csv('titanic.csv')
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [20]:
titanic.Name

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [21]:
#split text : .split()
titanic.Name.str.split(',')

0                             [Braund,  Mr. Owen Harris]
1      [Cumings,  Mrs. John Bradley (Florence Briggs ...
2                              [Heikkinen,  Miss. Laina]
3        [Futrelle,  Mrs. Jacques Heath (Lily May Peel)]
4                            [Allen,  Mr. William Henry]
                             ...
886                             [Montvila,  Rev. Juozas]
887                      [Graham,  Miss. Margaret Edith]
888          [Johnston,  Miss. Catherine Helen "Carrie"]
889                             [Behr,  Mr. Karl Howell]
890                               [Dooley,  Mr. Patrick]
Name: Name, Length: 891, dtype: object

In [23]:
#.get() : to access index value
titanic['Last_Name']=titanic.Name.str.split(',').str.get(0)
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Last_Name
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Braund
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Cumings
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Heikkinen
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Futrelle
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Allen
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,Montvila
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,Graham
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,Johnston
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,Behr
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,Dooley

In [24]:
titanic.Last_Name.str.len()

0      6
1      7
2      9
3      8
4      5
      ..
886    8
887    6
888    8
889    4
890    6
Name: Last_Name, Length: 891, dtype: int64

In [26]:
titanic['First_name']=titanic.Name.str.split(',').str.get(1)
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Last_Name,First_name
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Braund,Mr. Owen Harris
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Cumings,Mrs. John Bradley (Florence Briggs Thayer)
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Heikkinen,Miss. Laina
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Futrelle,Mrs. Jacques Heath (Lily May Peel)
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Allen,Mr. William Henry
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,Montvila,Rev. Juozas
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,Graham,Miss. Margaret Edith
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,Johnston,"Miss. Catherine Helen ""Carrie"""
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,Behr,Mr. Karl Howell
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,Dooley,Mr. Patrick

In [27]:
titanic.Name.str.split(',').str.get(1).str.len()

0      16
1      43
2      12
3      35
4      18
       ..
886    12
887    21
888    31
889    16
890    12
Name: Name, Length: 891, dtype: int64

In [29]:
# strip(),rstrip(),lstrip()

titanic.Name.str.split(',').str.get(1).str.strip().str.split(' ')

0                                    [Mr., Owen, Harris]
1      [Mrs., John, Bradley, (Florence, Briggs, Thayer)]
2                                         [Miss., Laina]
3              [Mrs., Jacques, Heath, (Lily, May, Peel)]
4                                  [Mr., William, Henry]
                             ...
886                                       [Rev., Juozas]
887                             [Miss., Margaret, Edith]
888                  [Miss., Catherine, Helen, "Carrie"]
889                                  [Mr., Karl, Howell]
890                                       [Mr., Patrick]
Name: Name, Length: 891, dtype: object

In [34]:
titanic[['Title','first_name_no_Title']]=titanic.Name.str.split(',').str.get(1).str.strip().str.split(' ',n=1,expand= True)

In [35]:
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Last_Name,First_name,Title,first_name,first_name_no_Title
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Braund,Mr. Owen Harris,Mr.,Owen Harris,Owen Harris
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Cumings,Mrs. John Bradley (Florence Briggs Thayer),Mrs.,John Bradley (Florence Briggs Thayer),John Bradley (Florence Briggs Thayer)
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Heikkinen,Miss. Laina,Miss.,Laina,Laina
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Futrelle,Mrs. Jacques Heath (Lily May Peel),Mrs.,Jacques Heath (Lily May Peel),Jacques Heath (Lily May Peel)
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Allen,Mr. William Henry,Mr.,William Henry,William Henry
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,Montvila,Rev. Juozas,Rev.,Juozas,Juozas
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,Graham,Miss. Margaret Edith,Miss.,Margaret Edith,Margaret Edith
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,Johnston,"Miss. Catherine Helen ""Carrie""",Miss.,"Catherine Helen ""Carrie""","Catherine Helen ""Carrie"""
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,Behr,Mr. Karl Howell,Mr.,Karl Howell,Karl Howell
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,Dooley,Mr. Patrick,Mr.,Patrick,Patrick

In [36]:
# replace content
titanic.Title.value_counts()

Title
Mr.          517
Miss.        182
Mrs.         125
Master.       40
Dr.            7
Rev.           6
Col.           2
Mlle.          2
Major.         2
Ms.            1
Mme.           1
Don.           1
Lady.          1
Sir.           1
Capt.          1
the            1
Jonkheer.      1
Name: count, dtype: int64

In [37]:
titanic.Title=titanic.Title.str.replace('Ms.','Miss.')

In [38]:
titanic.Title.value_counts()

Title
Mr.          517
Miss.        183
Mrs.         125
Master.       40
Dr.            7
Rev.           6
Mlle.          2
Major.         2
Col.           2
Don.           1
Mme.           1
Lady.          1
Sir.           1
Capt.          1
the            1
Jonkheer.      1
Name: count, dtype: int64

# Finding things

In [41]:
# to find string starts with
titanic.Last_Name[titanic.Last_Name.str.startswith('A')]

4                Allen
13           Andersson
25             Asplund
40               Ahlin
49      Arnold-Franchi
68           Andersson
91          Andreasson
114            Attalah
119          Andersson
144             Andrew
146          Andersson
182            Asplund
192    Andersen-Jensen
207           Albimona
210                Ali
233            Asplund
244            Attalah
261            Asplund
275            Andrews
279             Abbott
297            Allison
305            Allison
308            Abelson
353     Arnold-Franchi
363               Asim
365              Adahl
369             Aubart
401              Adams
460           Anderson
493       Artagaveytia
498            Allison
518              Angle
541          Andersson
542          Andersson
571           Appleton
610          Andersson
700              Astor
730              Allen
746             Abbott
780              Ayoub
784                Ali
806            Andrews
810          Alexander
813          Andersson
833         Augustsson
834              Allum
840           Alhomaki
845             Abbing
850          Andersson
855                Aks
874            Abelson
Name: Last_Name, dtype: object

In [45]:
titanic.Last_Name[titanic.Last_Name.str.endswith('a')]

50                   Panula
113                 Jussila
164                  Panula
173                  Sivola
207                Albimona
243                 Maenpaa
255                   Touma
266                  Panula
296                   Hanna
307    Penasco y Castellana
362                 Barbara
367                  Moussa
402                 Jussila
483                 Turkula
493            Artagaveytia
505    Penasco y Castellana
579                 Jussila
638                  Panula
677                   Turja
679                 Cardeza
686                  Panula
702                 Barbara
761                   Nirva
824                  Panula
837                  Sirota
842                Serepeca
886                Montvila
Name: Last_Name, dtype: object

In [47]:
# find() : return lowest index point
# -1 defines there is no substring
titanic.Last_Name.str.find('a')

0      2
1     -1
2     -1
3     -1
4     -1
      ..
886    7
887    2
888   -1
889   -1
890   -1
Name: Last_Name, Length: 891, dtype: int64

In [49]:
# slice(start,stop,step) : create substring by slicing string
titanic.first_name.str.slice(2,15,2)

0        e ars
1      h rde F
2           ia
3      cusHah(
4       limHny
        ...
886         oa
887     rae dt
888    teieHln
889      r oel
890        tik
Name: first_name, Length: 891, dtype: object

In [50]:
titanic.first_name

0                                Owen Harris
1      John Bradley (Florence Briggs Thayer)
2                                      Laina
3              Jacques Heath (Lily May Peel)
4                              William Henry
                       ...
886                                   Juozas
887                           Margaret Edith
888                 Catherine Helen "Carrie"
889                              Karl Howell
890                                  Patrick
Name: first_name, Length: 891, dtype: object

In [53]:
titanic[titanic.Name=='Mr.']

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked, Last_Name, First_name, Title, first_name, first_name_no_Title]
Index: []

In [56]:
titanic[titanic.Name.str.contains('Mr.',case=False)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Last_Name,First_name,Title,first_name,first_name_no_Title
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Braund,Mr. Owen Harris,Mr.,Owen Harris,Owen Harris
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Cumings,Mrs. John Bradley (Florence Briggs Thayer),Mrs.,John Bradley (Florence Briggs Thayer),John Bradley (Florence Briggs Thayer)
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Futrelle,Mrs. Jacques Heath (Lily May Peel),Mrs.,Jacques Heath (Lily May Peel),Jacques Heath (Lily May Peel)
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Allen,Mr. William Henry,Mr.,William Henry,William Henry
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q,Moran,Mr. James,Mr.,James,James
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S,Banfield,Mr. Frederick James,Mr.,Frederick James,Frederick James
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S,Sutehall,Mr. Henry Jr,Mr.,Henry Jr,Henry Jr
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q,Rice,Mrs. William (Margaret Norton),Mrs.,William (Margaret Norton),William (Margaret Norton)
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,Behr,Mr. Karl Howell,Mr.,Karl Howell,Karl Howell
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,Dooley,Mr. Patrick,Mr.,Patrick,Patrick

# find out Surname are in top 5 on the basis of occurance

In [58]:
titanic.Last_Name.value_counts().head()

Last_Name
Andersson    9
Sage         7
Skoog        6
Panula       6
Carter       6
Name: count, dtype: int64

# find out first name less than 10 character

In [64]:
(titanic.first_name.str.len()<10).value_counts()

first_name
False    543
True     348
Name: count, dtype: int64